app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "yellow pad"], ["room_number", 55], ["created_at", "2018-12-17 19:55:01.344669"], ["updated_at", "2018-12-17 19:55:01.344669"]]
---
  def create
    @school_class = SchoolClass.create(school_class_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-12-17 20:03:39.994530"], ["id", 1]]
---
  def update
    @school_class.update(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_school_class
    @school_class = SchoolClass.find(params[:id])