app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "joyce"], ["last_name", "kwon"], ["created_at", "2018-12-17 19:56:48.972151"], ["updated_at", "2018-12-17 19:56:48.972151"]]
---
  def create
    @student = Student.create(student_params)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-12-17 20:03:40.168192"], ["id", 1]]
---
  def update
    @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_student
    @student = Student.find(params[:id])